HomeWork-3/reports/R10-d5m/wrk.txt
Running 5m test @ http://localhost:5000
  2 threads and 4 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   750.86ms   72.66ms   1.21s    85.79%
    Req/Sec     3.67      3.19    10.00     82.30%
  1597 requests in 5.00m, 1.17MB read
Requests/sec:      5.32
Transfer/sec:      3.99KB