HomeWork-3/reports/R10-d5m/wrk2.txt
Running 5m test @ http://localhost:5000
  2 threads and 4 connections
  Thread calibration: mean lat.: 2518.208ms, rate sampling interval: 6832ms
  Thread calibration: mean lat.: 2620.656ms, rate sampling interval: 7131ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.55m     1.05m    3.07m    44.34%
    Req/Sec     1.41      0.52     3.00     98.78%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.54m 
 75.000%    2.66m 
 90.000%    2.91m 
 99.000%    3.06m 
 99.900%    3.07m 
 99.990%    3.07m 
 99.999%    3.07m 
100.000%    3.07m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    3704.831     0.000000            1         1.00
   12386.303     0.100000          110         1.11
   22609.919     0.200000          220         1.25
   35848.191     0.300000          329         1.43
   62488.575     0.400000          439         1.67
   92471.295     0.500000          548         2.00
  107544.575     0.550000          603         2.22
  122224.639     0.600000          658         2.50
  137887.743     0.650000          714         2.86
  152698.879     0.700000          768         3.33
  159383.551     0.750000          822         4.00
  162004.991     0.775000          852         4.44
  164364.287     0.800000          877         5.00
  166854.655     0.825000          905         5.71
  169345.023     0.850000          932         6.67
  171835.391     0.875000          960         8.00
  173277.183     0.887500          976         8.89
  174325.759     0.900000          987        10.00
  175636.479     0.912500         1001        11.43
  176816.127     0.925000         1014        13.33
  178126.847     0.937500         1029        16.00
  178782.207     0.943750         1035        17.78
  179437.567     0.950000         1043        20.00
  180092.927     0.956250         1049        22.86
  180617.215     0.962500         1055        26.67
  181272.575     0.968750         1062        32.00
  181665.791     0.971875         1067        35.56
  181927.935     0.975000         1070        40.00
  182190.079     0.978125         1073        45.71
  182452.223     0.981250         1076        53.33
  182714.367     0.984375         1079        64.00
  182976.511     0.985938         1082        71.11
  183107.583     0.987500         1083        80.00
  183369.727     0.989062         1086        91.43
  183369.727     0.990625         1086       106.67
  183500.799     0.992188         1088       128.00
  183631.871     0.992969         1089       142.22
  183762.943     0.993750         1091       160.00
  183762.943     0.994531         1091       182.86
  183762.943     0.995313         1091       213.33
  184025.087     0.996094         1093       256.00
  184025.087     0.996484         1093       284.44
  184025.087     0.996875         1093       320.00
  184287.231     0.997266         1095       365.71
  184287.231     0.997656         1095       426.67
  184287.231     0.998047         1095       512.00
  184287.231     0.998242         1095       568.89
  184287.231     0.998437         1095       640.00
  184287.231     0.998633         1095       731.43
  184287.231     0.998828         1095       853.33
  184287.231     0.999023         1095      1024.00
  184418.303     0.999121         1096      1137.78
  184418.303     1.000000         1096          inf
#[Mean    =    93241.596, StdDeviation   =    62925.520]
#[Max     =   184287.232, Total count    =         1096]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  808.45ms
 75.000%    1.43s 
 90.000%    1.55s 
 99.000%    1.68s 
 99.900%    1.79s 
 99.990%    1.80s 
 99.999%    1.80s 
100.000%    1.80s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     503.039     0.000000            1         1.00
     733.183     0.100000          111         1.11
     747.007     0.200000          222         1.25
     759.807     0.300000          330         1.43
     776.191     0.400000          439         1.67
     808.447     0.500000          548         2.00
     861.695     0.550000          603         2.22
    1276.927     0.600000          658         2.50
    1346.559     0.650000          713         2.86
    1389.567     0.700000          768         3.33
    1432.575     0.750000          822         4.00
    1452.031     0.775000          850         4.44
    1469.439     0.800000          878         5.00
    1485.823     0.825000          907         5.71
    1509.375     0.850000          934         6.67
    1524.735     0.875000          959         8.00
    1534.975     0.887500          973         8.89
    1545.215     0.900000          988        10.00
    1562.623     0.912500         1001        11.43
    1575.935     0.925000         1016        13.33
    1593.343     0.937500         1029        16.00
    1596.415     0.943750         1035        17.78
    1603.583     0.950000         1044        20.00
    1611.775     0.956250         1049        22.86
    1619.967     0.962500         1055        26.67
    1632.255     0.968750         1063        32.00
    1635.327     0.971875         1067        35.56
    1640.447     0.975000         1071        40.00
    1650.687     0.978125         1073        45.71
    1655.807     0.981250         1077        53.33
    1660.927     0.984375         1079        64.00
    1666.047     0.985938         1081        71.11
    1672.191     0.987500         1083        80.00
    1681.407     0.989062         1085        91.43
    1682.431     0.990625         1087       106.67
    1689.599     0.992188         1088       128.00
    1692.671     0.992969         1089       142.22
    1694.719     0.993750         1090       160.00
    1702.911     0.994531         1091       182.86
    1702.911     0.995313         1091       213.33
    1703.935     0.996094         1092       256.00
    1707.007     0.996484         1093       284.44
    1707.007     0.996875         1093       320.00
    1767.423     0.997266         1094       365.71
    1767.423     0.997656         1094       426.67
    1767.423     0.998047         1094       512.00
    1787.903     0.998242         1095       568.89
    1787.903     0.998437         1095       640.00
    1787.903     0.998633         1095       731.43
    1787.903     0.998828         1095       853.33
    1787.903     0.999023         1095      1024.00
    1804.287     0.999121         1096      1137.78
    1804.287     1.000000         1096          inf
#[Mean    =     1058.255, StdDeviation   =      356.569]
#[Max     =     1803.264, Total count    =         1096]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1161 requests in 5.00m, 0.86MB read
Requests/sec:      3.87
Transfer/sec:      2.92KB